<template>
	<div>
	  <h1>vue组件化的理解</h1>
		<!-- 
			组件化是可复用的模块，可以增强代码的复用性、可维护性、可测试性。
			使用场景↓↓↓↓↓↓↓↓↓↓↓↓↓
			通用组件：实现最基础的功能，比如按钮，输入框。。。。。
			业务组件：因为涉及到业务方面，复用性就有会所降低，比如表单、轮播图。。。。。。
			页面组件：多个页面都是一个样式就会用到，比如详情页、编辑页。。。。。。
			↑↑↑↑↑↑↑↑↑
			组件可以分为两个组件 有状态组件、无状态组件、抽象组件
			有状态组件就是当父组件给到子组件值后，子组件去修改这个值
			无状态组件又可以称为 functional组件  他和有状态组件相反 复用性比较高
			抽象组件可以用来完成一些特定的功能 就比如一些没有实际的视图的功能 防抖 防重之类的这些
			
			剩下的自由发挥  vue组件这玩意本身就是一个活得东西 没有一套完整的理论知识可以把他表达完整 
			当你觉得这个功能可以复用的时候 就去试着把他封装成一个组件吧
		 -->
	</div>
  </template>
  
  <script>
 
  export default {
		name: 'vueComponents',
		data () {
			return {
				
			}
		}
  }
  </script>
  <style scoped>
  
  </style>
  